In [2]:
print("Hello World")

# Classic 1st line of code in any coding language - respect...

Hello World

In [1]:
for x in range(5):
    print("Hello", x, " times")
    
# Set up a simple for loop 
# (REMEMBER counting begins from ZERO !!! and excludes 5)

Hello 0  times
Hello 1  times
Hello 2  times
Hello 3  times
Hello 4  times

In [3]:
for x in range(10):
    if x > 5:
        break
    else:
        print("Hi again", x, " times")
        
# For loop, but add a CONDITIONAL and add a 'BREAK' to exit loop
# Don't forget to use 'ELSE' if needed or 'ELIF' for multiple ifs

Hi again 0  times
Hi again 1  times
Hi again 2  times
Hi again 3  times
Hi again 4  times
Hi again 5  times

In [4]:
urnamePlease=str(input("Hey, what's your name?"))

# Notice the use of 'str' in front of input?  It converts anything
# user enters, into a string

Hey, what's your name? 73

In [5]:
type(urnamePlease)

str

In [19]:
# Create a DataFrame Manually calling pd.DataFrame (won't work with CSV's)

import pandas as pd
data={"Galaxies": ["one"], "Wormholes": ["two"], "Nebulae": ["three"]} # Notice the [] for values
# You must use them or throw an error without them

colnams=["Galaxies", "Wormholes", "Nebulae"]

df = pd.DataFrame.from_dict(data)

In [20]:
# add some extra data to df with .loc

df.loc[1]=["four", "five", "six"]
df.loc[2]=["a", "b", "c"]
df

  Galaxies Wormholes Nebulae
0      one       two   three
1     four      five     six
2        a         b       c

In [21]:
# Reindex with "strings"

mystringindex=["Kirk's View", "Spock's View", "Bone's View"]
df.reindex(mystringindex)

             Galaxies Wormholes Nebulae
Kirk's View       NaN       NaN     NaN
Spock's View      NaN       NaN     NaN
Bone's View       NaN       NaN     NaN

In [22]:
# Reindex back to default

df.reindex()

  Galaxies Wormholes Nebulae
0      one       two   three
1     four      five     six
2        a         b       c

In [27]:
# Add 2 extra columns to the df and fill them with boolean values of either True or False

df["PhaserIssued"] = True
df["SafeSpace"] = False
df

  Galaxies Wormholes Nebulae  PhaserIssued  SafeSpace
0      one       two   three          True      False
1     four      five     six          True      False
2        a         b       c          True      False

In [32]:
# Rename 2 columns

df=df.rename(columns={"PhaserIssued": "FriendlyTerritory", "SafeSpace": "HolyGround"})
df

  Galaxies Wormholes Nebulae  FriendlyTerritory  HolyGround
0      one       two   three               True       False
1     four      five     six               True       False
2        a         b       c               True       False

In [33]:
# Make a cell empty or na or NaN

df.loc[2, "Nebulae"] = ""
df

  Galaxies Wormholes Nebulae  FriendlyTerritory  HolyGround
0      one       two   three               True       False
1     four      five     six               True       False
2        a         b                       True       False

In [34]:
# Change Nebulae values to numbers manually with .loc

df.loc[0, "Nebulae"] = 3
df.loc[1, "Nebulae"] = 6
df

  Galaxies Wormholes Nebulae  FriendlyTerritory  HolyGround
0      one       two       3               True       False
1     four      five       6               True       False
2        a         b                       True       False

In [35]:
# Dependencies
import pandas as pd  # normally put this at the very top of your code

In [45]:
# Name of the CSV file

#df_file = "C:\\Users\\MyComputerName\\Desktop\\donors2008_unclean.csv" # for windows users; this dataset is from Week4-2 Activity #3
df_file = '/Users/Rufee/Desktop/donors2008_unclean.csv' # for Mac users; this dataset is from Week4-2 Activity #3

In [75]:
# The correct encoding must be used to read the CSV in pandas
df = pd.read_csv(df_file)  # default encoding is 'utf8' but you can also use encoding="ISO-8859-1

# you can tell pandas in advance what datatypes the columns are before reading with pd.read_csv
file2 = pd.read_csv(file, dtype={"avg_cost": object, "population": object})

In [76]:
# Print out the first or last rows to quickly view(default may be 5 rows, but you can insert any # you like in the ())

df.head()
#df.tail()

  LastName FirstName          Employer      City State    Zip  Amount  FIELD8
0    Aaron    Eugene  State Department    Dulles    VA  20189   500.0     NaN
1    Abadi   Barbara       Abadi & Co.  New York    NY  10021   200.0     NaN
2  Adamany   Anthony           Retired  Rockford    IL  61103   500.0     NaN
3    Adams  Lorraine              Self  New York    NY  10026   200.0     NaN
4    Adams    Marion              None    Exeter    NH  03833   100.0     NaN

In [77]:
# Identify incomplete rows
print(df.count()) # counts the number of non-empty cells in each column

# Or conversely...

#Also can use the following to count na's
df.isna().sum()  #. counts the number of empty cells in each column

# Why not make it a good practice to call both of these methods on a relatively unexplored df

LastName     1776
FirstName    1776
Employer     1743
City         1776
State        1776
Zip          1776
Amount       1776
FIELD8          0
dtype: int64

LastName        0
FirstName       0
Employer       33
City            0
State           0
Zip             0
Amount          0
FIELD8       1776
dtype: int64

In [78]:
# Delete extraneous column
del df['FIELD8']
df.head()

  LastName FirstName          Employer      City State    Zip  Amount
0    Aaron    Eugene  State Department    Dulles    VA  20189   500.0
1    Abadi   Barbara       Abadi & Co.  New York    NY  10021   200.0
2  Adamany   Anthony           Retired  Rockford    IL  61103   500.0
3    Adams  Lorraine              Self  New York    NY  10026   200.0
4    Adams    Marion              None    Exeter    NH  03833   100.0

In [79]:
# Drop all rows with missing information
df=df.dropna(how='any') # default parameters for dropana are 'index=0' and 'how=any' - see documentation; Note:  if you issue this command BEFORE deleting FIELD8 column, you will delete the entire df
#  dropping rows may not be an acceptable solution... may have to 'replace' missing data with something else ... averages? an algorithm to replace, or some other method to impute

# Check again after dropping ...
print(df.count())
df.isna().sum()

LastName     1743
FirstName    1743
Employer     1743
City         1743
State        1743
Zip          1743
Amount       1743
dtype: int64

LastName     0
FirstName    0
Employer     0
City         0
State        0
Zip          0
Amount       0
dtype: int64

In [80]:
Check all the columns for datatype
df.dtypes

LastName      object
FirstName     object
Employer      object
City          object
State         object
Zip           object
Amount       float64
dtype: object

In [103]:
# Use pd.to_numeric() method to convert the datatype of the Amount column - assuming it is 'object' before transformation
df['Amount'] = pd.to_numeric(df['Amount'])

In [104]:
# Display an overview of the Employers column
df['Employer'].value_counts()

None                       249
Self                       241
Retired                    126
Self Employed               39
Self-Employed               34
                          ...
England Law Office           1
SC Investments, Inc.         1
Postal Service               1
Retired U Cal Professor      1
HEPA                         1
Name: Employer, Length: 1011, dtype: int64

In [106]:
# Clean up Employer category. Replace 'Self Employed' and 'Self' with 'Self-Employed'
df['Employer'] = df['Employer'].replace(
    {'Self Employed': 'Self-Employed', 'Self': 'Self-Employed'})
df['Employer'].value_counts() # Call this again to analyze the change

Self-Employed           314
None                    249
Retired                 126
Google                    6
Not Employed              4
                       ...
Pace Law School           1
England Law Office        1
SC Investments, Inc.      1
Postal Service            1
HEPA                      1
Name: Employer, Length: 1009, dtype: int64

In [107]:
# Display a statistical overview
# We can infer the maximum allowable individual contribution from 'max'
df.describe()

            Amount
count  1743.000000
mean    640.124750
std    1242.343265
min       5.000000
25%     200.000000
50%     250.000000
75%     500.000000
max    5000.000000

In [ ]:
# Merge two dataframes using an inner join
merge_df = pd.merge(info_df, items_df, on="customer_id")

In [ ]:
 Merge two dataframes using an outer join
merge_df = pd.merge(info_df, items_df, on="customer_id", how="outer")

In [ ]:
# Merge two dataframes using a left join
merge_df = pd.merge(info_df, items_df, on="customer_id", how="left")

In [ ]:
merge_df = pd.merge(info_df, items_df, on="customer_id", how="right")

In [ ]:
# Collecting best open for Bitcoin and Dash using .max()
bitcoin_open = bitcoin_df["Open"].max()
dash_open = dash_df['Open'].max()

In [ ]:
# Create Bins
import pandas as pd
raw_data = {
    'Class': ['Oct', 'Oct', 'Jan', 'Jan', 'Oct', 'Jan'], 
    'Name': ["Cyndy", "Logan", "Laci", "Elmer", "Crystle", "Emmie"], 
    'Test Score': [90, 59, 72, 88, 98, 60]}  #This construction from a Dict only works if the VALUES of the Dict are in [] square brackets, even if just one
df = pd.DataFrame(raw_data)
bins = [0, 59.9, 69.9, 79.9, 89.9, 100]

# Create the names for the five bins
group_names = ["F", "D", "C", "B", "A"]
df["Test Score Summary"] = pd.cut(df["Test Score"], bins, labels=group_names, include_lowest=True) # inlclude_lowest=False is default, and it means left-include 1st interval or not
df

In [ ]:
# Creating a group based off of the bins
df = df.groupby("Test Score Summary") # This produces only the group-by Object
df.max() # This activates the Object

In [ ]:
# To run statistics on all numeric columns use .describe()
ted_df.describe()

In [ ]:
# Statistics can be run manually one at a time
ted_df2["comments"].count()
ted_df2["comments"].mean()

In [ ]:
# Let's check the dtype of each column after the df has already been created

print(file_df.dtypes)

In [ ]:
# Use .format to convert column datatype to another different datatype

file_df["avg_cost"] = file_df["avg_cost"].map("${:.2f}".format)
file_df["population"] = file_df["population"].map("{:,}".format)
file_df["other"] = file_df["other"].map("{:.2f}".format)

hosted_in_us_df["average_donation"] = hosted_in_us_df["average_donation"].astype(float).map(
    "${:,.2f}".format)
hosted_in_us_df["goal"] = hosted_in_us_df["goal"].astype(float).map("${:,.2f}".format)
hosted_in_us_df["pledged"] = hosted_in_us_df["pledged"].astype(float).map("${:,.2f}".format)

In [ ]:
# Get a list of all of our columns for easy reference
df.columns

In [ ]:
# Extract "name", "goal", "pledged", "state", "country", "staff_pick",
# "backers_count", and "spotlight"

reduced_kickstarter_df = df.loc[:, ["name", "goal", "pledged", "state", "country", "staff_pick", "backers_count", "spotlight"]]
reduced_kickstarter_df

In [ ]:
# Remove projects that made no money at all; CHANGE THE FORUMULA of the template:

reduced_kickstarter_df = reduced_kickstarter_df.loc[(reduced_kickstarter_df["pledged"] > 0)]
reduced_kickstarter_df.head()

In [ ]:
# Create a new column that finds the average amount pledged to a project; NOTE: when dividing one column by another, a COLUMN is the result, not a single value

average_donation = hosted_in_us_df['pledged'] / hosted_in_us_df['backers_count']
average_donation